Revit 2026 API

# UIThemeManager Methods

---

The UIThemeManager type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | GetThemeName | Gets the theme name for the given theme type. |

#### Reference

UIThemeManager Class

Autodesk.Revit.UI Namespace